# Задача 5: Обратный порядок чисел
# Напишите программу, которая запрашивает у пользователя трехзначное число и выводит его цифры в обратном порядке.
# Пример:
# Ввод: 123
# Вывод: 321

x = int(input())
print((x%10),((x%100)-(x%10)) // 10, x//100, sep = '')